read_verilog synth/*
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty synth/lib/yosys.lib
abc -liberty synth/lib/yosys.lib
clean
write_verilog synth/synth.v