
===========================================================================
report_tns
============================================================================
tns -165.28

===========================================================================
report_wns
============================================================================
wns -3.75

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -3.75

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.13
