
===========================================================================
report_tns
============================================================================
tns -25117.06

===========================================================================
report_wns
============================================================================
wns -18.93

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -18.93

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.15
