
===========================================================================
report_tns
============================================================================
tns -18743.63

===========================================================================
report_wns
============================================================================
wns -13.89

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -13.89

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.14
