
===========================================================================
report_tns
============================================================================
tns -183.27

===========================================================================
report_wns
============================================================================
wns -3.96

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -3.96

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.13
